# Pandas

Pandas is an open source library. It is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language. 
It let's us work with spreadsheets along with using latest Python libraries and functions.

## Working with Pandas

In [15]:
import pandas as pd  #imports pandas

##### Pandas has two types of data structures:
#### Series:
It is a one dimensional array with indexes, it stores a single column or row od data in a datasheet.  
#### DataFrame:
Its a tabular spreadsheet like structure representing rows each of which contains one or nultiple columns.

### Creating a Pandas series

In [16]:
y = [13, 24, 36]  #creating a python list
s = pd.Series(y)  #converting python list into series
s

0    13
1    24
2    36
dtype: int64

### Creating Pandas DataFrame

In [34]:
# Let us consider a dictionary
exa = {
    'Name' : ['Neil', 'Aishwarya', 'Rahul', 'Shivani','Namrata','Pawan', 'Karan','Krish'],
    'Age' : [23, 21, 22, 21, 20, 22, 22, 23],
    'University' : ['BHU', 'PU', 'DU', 'BHU', 'IIT', 'MU', 'JNU', 'MU'],
    'Specialization' : ['Mathematics' , 'Biology', 'Physics' , 'Chemistry', 'Accountancy', 'Mathematics', 'Bio-Chemistry', 'Astrophysics']}
df = pd.DataFrame(exa) # pd.DataFrame() converts dictionary into a data frame
print(df) #prints the data frame

        Name  Age University Specialization
0       Neil   23        BHU    Mathematics
1  Aishwarya   21         PU        Biology
2      Rahul   22         DU        Physics
3    Shivani   21        BHU      Chemistry
4    Namrata   20        IIT    Accountancy
5      Pawan   22         MU    Mathematics
6      Karan   22        JNU  Bio-Chemistry
7      Krish   23         MU   Astrophysics

### We can also convert this DataFrame into .csv file which can be opened in Excel sheets by the following command.

In [35]:
df.to_csv("nameofthefile.csv")  #creates a excel file on the system.

Sometimes we just want to have access to only few rows of the dataframe, in these cases we can use **head()** or **tail()** function.

In [36]:
df.head(3) #prints only top 3 rows of the dataframe

        Name  Age University Specialization
0       Neil   23        BHU    Mathematics
1  Aishwarya   21         PU        Biology
2      Rahul   22         DU        Physics

In [37]:
df.tail(2) #prints only last 2 rows of the dataframe

    Name  Age University Specialization
6  Karan   22        JNU  Bio-Chemistry
7  Krish   23         MU   Astrophysics

### We can also access excel files in the Notebook with the following command. 
Assume there's an excel.csv file on the system. it can be opened on the notebook by following command.

pd.read_csv('salaries.csv')  
##### opens an excel file named salaries from the system

##### We can access any column of the DataFrame by following command:

In [39]:
df['Age']  #prints age column only as an index of the dataframe.

0    23
1    21
2    22
3    21
4    20
5    22
6    22
7    23
Name: Age, dtype: int64

In [42]:
df['Age'][2] #prints element of column age indexed 2.

22

###### We can also change the index of the dataframe like this:

In [45]:
df.index = [1,2,3,4,5,6,7,8]  # specifying the desired index.
df

        Name  Age University Specialization
1       Neil   23        BHU    Mathematics
2  Aishwarya   21         PU        Biology
3      Rahul   22         DU        Physics
4    Shivani   21        BHU      Chemistry
5    Namrata   20        IIT    Accountancy
6      Pawan   22         MU    Mathematics
7      Karan   22        JNU  Bio-Chemistry
8      Krish   23         MU   Astrophysics

In [46]:
df.info() #data summary

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 1 to 8
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            8 non-null      object
 1   Age             8 non-null      int64
 2   University      8 non-null      object
 3   Specialization  8 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

##### We can also calculate the statistical summary of the data using .describe()

In [47]:
df.describe()

             Age
count   8.000000
mean   21.750000
std     1.035098
min    20.000000
25%    21.000000
50%    22.000000
75%    22.250000
max    23.000000

## Some Other Important Functions

##### .loc()

##### Access a group of rows and columns by their name.

In [52]:
df.loc[:,'University'] # Prints column labelled 'University'

1    BHU
2     PU
3     DU
4    BHU
5    IIT
6     MU
7    JNU
8     MU
Name: University, dtype: object

In [53]:
df.loc[2,:] # Prints row labelled '2'

Name              Aishwarya
Age                      21
University               PU
Specialization      Biology
Name: 2, dtype: object

In [54]:
df.loc[5,'Name'] # Prints element from 'Name' column and 5 row

'Namrata'

##### .iloc()

##### Access a group of rows and columns by their index.

In [55]:
df.iloc[:,3] # Prints column indexed 3

1      Mathematics
2          Biology
3          Physics
4        Chemistry
5      Accountancy
6      Mathematics
7    Bio-Chemistry
8     Astrophysics
Name: Specialization, dtype: object

In [56]:
df.iloc[3,:] # Prints row indexed 3

Name                Shivani
Age                      21
University              BHU
Specialization    Chemistry
Name: 4, dtype: object

In [57]:
df.iloc[7,3]  # Prints element at intersection of 7 indexed row and 3 indexed column.

'Astrophysics'